Public Member Functions | Protected Member Functions | List of all members
Tracking::Tracker::InEditKeyboardHandler Class Reference
Tracker API
Class to derive from, when creating custom keyboard handlers for the tracker's edit mode. More...
#include <Tracker.hpp>
 Inheritance diagram for Tracking::Tracker::InEditKeyboardHandler:
 Public Member Functions
InEditKeyboardHandler (Tracker &tracker)
Constructor for the InEditKeyboardHandler.
virtual  | ~InEditKeyboardHandler ()
 Protected Member Functions
Tracker &  | GetTracker ()
Gets the parent tracker, where the events will be handled.
virtual DG::EventHandlerResultType  | KeyPressed (const DG::Key::Code &code, DG::Item **item) override
Handles a regular key press event.
virtual DG::EventHandlerResultType  | KeyPressed (const DG::Key::Modifier &modifier, DG::Item **item) override
Handles a modifier key press event.
Detailed Description
Class to derive from, when creating custom keyboard handlers for the tracker's edit mode.
Constructor & Destructor Documentation
◆ InEditKeyboardHandler()
 Tracking::Tracker::InEditKeyboardHandler::InEditKeyboardHandler  |  ( |  Tracker &  |  tracker | )
Constructor for the InEditKeyboardHandler.
Parameters
[in] | tracker | the parent tracker, where the events will be handled
◆ ~InEditKeyboardHandler()
 virtual Tracking::Tracker::InEditKeyboardHandler::~InEditKeyboardHandler  |  ( |   | )
virtual
Destructor